#include <stdio.h>

void main(){
	// 한글	
    printf("첫 번째 입력: 2, 두 번째 입력: 1에 대한 사칙연산\n");
	// 변수의 성격을 갖는 값을 코드 상에서 임의로 지정하는 것을
	// 하드코딩(Hard coding)이라고 한다.
	// 유지보수성이 떨어진다. 개발자가 피해야 할 사항이다.
    printf("2+1=%d\n",2+1);
    printf("2-1=%d\n",2-1);
    printf("2*1=%d\n",2*1);
    printf("2/1=%d\n",2/1);

    printf("첫 번째 입력: 4, 두 번째 입력: 2에 대한 사칙연산\n");
    printf("4+2=%d\n",4+2);
    printf("4-2=%d\n",4-2);
    printf("4*2=%d\n",4*2);
    printf("4/2=%d\n",4/2);
    
	printf("첫 번째 입력: 12, 두 번째 입력: 4에 대한 사칙연산\n");
    printf("12+4=%d\n",12+4);
    printf("12-4=%d\n",12-4);
    printf("12*4=%d\n",12*4);
    printf("12/4=%d\n",12/4);
}
